Scenarios/XML/Scenario 12/Scenario_12_0_Original_checkPayrollSubmission_Request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:pay="http://www.ros.ie/schemas/paye-employers/v1/payroll/">
   <soap:Header/>
   <soap:Body>
      <pay:CheckPayrollSubmissionRequest>
         <pay:EmployerRegistrationNumber>8000075FH</pay:EmployerRegistrationNumber>
         
         <pay:TaxYear>2018</pay:TaxYear>
         <pay:SoftwareUsed>
            <pay:Name>SOAP UI</pay:Name>
            <pay:Version>5.4.0</pay:Version>
         </pay:SoftwareUsed>
         <pay:PayrollRunReference>Payroll-Run-Reference-7</pay:PayrollRunReference>
         <pay:SubmissionID>Submission-12_1</pay:SubmissionID>
      </pay:CheckPayrollSubmissionRequest>
   </soap:Body>
</soap:Envelope>