PIT3/Scenarios/XML/Scenario 19/Scenario_19_checkPayrollRun_Request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:pay="http://www.ros.ie/schemas/paye-employers/v1/payroll/">
   <soap:Header/>
   <soap:Body>
      <pay:CheckPayrollRunRequest>
         <pay:EmployerRegistrationNumber>8000074DH</pay:EmployerRegistrationNumber>
         <pay:TaxYear>2018</pay:TaxYear>
         <pay:SoftwareUsed>
            <pay:Name>SOAP UI</pay:Name>
            <pay:Version>5.4.0</pay:Version>
         </pay:SoftwareUsed>
         <pay:PayrollRunReference>Payroll-Run-Reference-19</pay:PayrollRunReference>
      </pay:CheckPayrollRunRequest>
   </soap:Body>
</soap:Envelope>	