PIT3/Scenarios/XML/Scenario 06/Scenario_06_a_Original_payrollSubmission_Request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:pay="http://www.ros.ie/schemas/paye-employers/v1/payroll/">
   <soap:Header/>
   <soap:Body>
     <PayrollSubmissionRequest xmlns="http://www.ros.ie/schemas/paye-employers/v1/payroll/">
	<SubmissionID>Submission-16A</SubmissionID>
	<BatchReference>
		<Index>1</Index>
		<Count>1</Count>
	</BatchReference>
	<Header>
		<EmployerRegistrationNumber>3390617EH</EmployerRegistrationNumber>
		<PayrollRunReference>Payroll-Run-Reference-1</PayrollRunReference>
		<TaxYear>2018</TaxYear>
		<SoftwareUsed>
			<Name>SOAP UI</Name>
			<Version>5.4.0</Version>
		</SoftwareUsed>
	</Header>
	<Payslip>
		<LineItemID>LineItem-TTT</LineItemID>
		<EmployeeID>
			<EmployeePPSN>01234567T</EmployeePPSN>
			<EmploymentID>1</EmploymentID>
		</EmployeeID>
		<Name>
			<FirstName>Sara</FirstName>
			<FamilyName>Tester</FamilyName>
		</Name>
		<ShadowPayroll>false</ShadowPayroll>
		<PayFrequency>Weekly</PayFrequency>
		<NumberOfPayPeriods>52</NumberOfPayPeriods>
		<RPNNumber>3</RPNNumber>
		<ExclusionOrder>false</ExclusionOrder>
		<PayDate>2018-03-20</PayDate>
		<GrossPay>1000.00</GrossPay>
		<PayForIncomeTax>1000.00</PayForIncomeTax>
		<IncomeTaxPaid>189.00</IncomeTaxPaid>
		<PayForEmployeePRSI>1000.00</PayForEmployeePRSI>
		<PayForEmployerPRSI>1000.00</PayForEmployerPRSI>
		<PRSIExempt>false</PRSIExempt>
		<PRSIClassDetail>
			<PRSIClass>A1</PRSIClass>
			<InsurableWeeks>1</InsurableWeeks>
		</PRSIClassDetail>
		<PRSIClassDetail>
			<PRSIClass>J1</PRSIClass>
			<InsurableWeeks>3</InsurableWeeks>
		</PRSIClassDetail>
		<EmployeePRSIPaid>40.00</EmployeePRSIPaid>
		<EmployerPRSIPaid>0.00</EmployerPRSIPaid>
		<PayForUSC>1000.00</PayForUSC>
		<USCStatus>Ordinary</USCStatus>
		<USCPaid>1000.00</USCPaid>
		<LPTDeducted>100.00</LPTDeducted>
		<GrossMedicalInsurance>100.00</GrossMedicalInsurance>
		<ShareBasedRemuneration>100.00</ShareBasedRemuneration>
		<TaxableBenefits>100.00</TaxableBenefits>
		<TaxableLumpSum>100.00</TaxableLumpSum>
		<NonTaxableLumpSum>100.00</NonTaxableLumpSum>
		<EmployerRBS>0.00</EmployerRBS>
		<EmployeeRBS>0.00</EmployeeRBS>
		<EmployerPRSA>0.00</EmployerPRSA>
		<EmployeePRSA>0.00</EmployeePRSA>
		<EmployeeRAC>0.00</EmployeeRAC>
		<EmployeeAVC>0.00</EmployeeAVC>
	</Payslip>
</PayrollSubmissionRequest>
   </soap:Body>
</soap:Envelope>